#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.eks.module.eks_managed_node_group["karpenter"].data.aws_partition.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.karpenter.data.aws_partition.current: Reading...
module.eks_admins_iam_group.aws_iam_group.this[0]: Refreshing state... [id=eks-admin]
module.eks_admins_iam_group.data.aws_caller_identity.current[0]: Reading...
module.eks_admins_iam_group.data.aws_partition.current: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.eks_managed_node_group["karpenter"].data.aws_caller_identity.current: Reading...
aws_iam_policy.eks_admin: Refreshing state... [id=arn:aws:iam::509399618437:policy/AmazonEKSAdminPolicy]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["karpenter"].data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_admins_iam_group.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current: Reading...
data.aws_availability_zones.available: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/cluster-dev/cluster]
module.karpenter.data.aws_region.current: Reading...
module.karpenter.data.aws_region.current: Read complete after 0s [id=ap-south-1]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.data.aws_caller_identity.current: Reading...
aws_iam_user.manager: Refreshing state... [id=manager]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=509399618437]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.eks_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
data.aws_iam_policy_document.aws_lbc: Reading...
data.aws_iam_policy_document.aws_lbc: Read complete after 0s [id=819195744]
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Read complete after 0s [id=819195744]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0adadb769b1e56ccd]
data.aws_caller_identity.current: Reading...
module.user1_iam_user.aws_iam_user.this[0]: Refreshing state... [id=user1]
aws_iam_policy.aws_lbc: Refreshing state... [id=arn:aws:iam::509399618437:policy/AWSLoadBalancerController]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=ap-south-1]
module.allow_eks_access_iam_policy.aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::509399618437:policy/allow-eks-access]
module.eks.module.eks_managed_node_group["karpenter"].data.aws_caller_identity.current: Read complete after 0s [id=509399618437]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::509399618437:assumed-role/aws-github-oidc/aws-github-oidc]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=cluster-dev-cluster-20241130012104332700000001]
module.eks.module.eks_managed_node_group["karpenter"].aws_iam_role.this[0]: Refreshing state... [id=karpenter-eks-node-group-20241130012104333700000002]
aws_iam_role.aws_lbc: Refreshing state... [id=dev-aws-lbc]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=509399618437]
module.karpenter.aws_iam_role.controller[0]: Refreshing state... [id=KarpenterController-20241130012104460400000003]
module.eks_admins_iam_group.data.aws_caller_identity.current[0]: Read complete after 1s [id=509399618437]
module.karpenter.data.aws_caller_identity.current: Read complete after 1s [id=509399618437]
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Reading...
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Read complete after 0s [id=2560088296]
data.aws_caller_identity.current: Read complete after 1s [id=509399618437]
module.eks_admins_iam_group.aws_iam_group_membership.this[0]: Refreshing state... [id=eks-admin]
module.eks_admins_iam_group.data.aws_iam_policy_document.iam_self_management: Reading...
aws_iam_role.eks_admin: Refreshing state... [id=dev-eks-admin]
module.eks_admins_iam_group.data.aws_iam_policy_document.iam_self_management: Read complete after 0s [id=3966440753]
module.eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=karpenter-eks-node-group-20241130012104333700000002-20241130012104687100000009]
module.eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=karpenter-eks-node-group-20241130012104333700000002-20241130012104640500000007]
module.eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=karpenter-eks-node-group-20241130012104333700000002-20241130012104675700000008]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=cluster-dev-cluster-20241130012104332700000001-20241130012104617800000005]
data.aws_availability_zones.available: Read complete after 1s [id=ap-south-1]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=cluster-dev-cluster-20241130012104332700000001-20241130012104622200000006]
aws_iam_role_policy_attachment.aws_lbc: Refreshing state... [id=dev-aws-lbc-20241130012104593900000004]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=249466270]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=e209ce0b-1335-47ca-a169-89445c90fc7c]
aws_iam_role_policy_attachment.eks_admin: Refreshing state... [id=dev-eks-admin-2024113001210500730000000b]
aws_iam_policy.eks_assume_admin: Refreshing state... [id=arn:aws:iam::509399618437:policy/AmazonEKSAssumeAdminPolicy]
aws_iam_user_policy_attachment.manager: Refreshing state... [id=manager-2024113001210485480000000a]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/cluster-dev]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::509399618437:policy/cluster-dev-cluster-ClusterEncryption20241130012129931700000013]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=cluster-dev-cluster-20241130012104332700000001-20241130012130216000000014]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0d4de0e9eac051bc4]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-072f2a86dcf9b8255]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0627177bc215aaf36]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-04428d6d8b2c9e2b8]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-073a7c1c5ac27d9e6]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-079af3f2bf9e5f9a6]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-04fb6a57159732864]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-003f928416fe1a4d4]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0faa5a4ed8386a7a1]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0ed0250f76e3e3729]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-01af8bd1410259ff1]
module.eks_admins_iam_role.data.aws_iam_policy_document.assume_role[0]: Reading...
module.eks_admins_iam_role.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=712609775]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0de10fc9a915d8d92]
module.eks_admins_iam_role.aws_iam_role.this[0]: Refreshing state... [id=eks-admin]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3711912263]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2916507527]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-823022073]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1029642380]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-139188310]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-4095573786]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1720325427]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3879813947]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2212524272]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-2992699015]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-160037992]
module.eks_admins_iam_role.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=eks-admin-20241130012121170800000010]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-06cb1588351ff1f10]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0acf88f73540a36eb]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-06c6c489d047fbafd]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-003f928416fe1a4d41080289494]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-09e8c1f901932cc81]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-060935c84dbaad0a1]
module.allow_assume_eks_admins_iam_policy.aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::509399618437:policy/allow-assume-eks-admin-iam-role]
module.eks_admins_iam_group.aws_iam_group_policy_attachment.custom_arns[0]: Refreshing state... [id=eks-admin-20241130012121488800000011]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=cluster-dev]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-070e5a871617a493a]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0ed0250f76e3e37291080289494]
module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=cluster-dev:arn:aws:iam::509399618437:role/aws-github-oidc]
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-11-30T01:30:38Z]
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.aws_ec2_tag.cluster_primary_security_group["terraform"]: Refreshing state... [id=sg-0ee0564992aca5f49,terraform]
module.eks.aws_ec2_tag.cluster_primary_security_group["Owner"]: Refreshing state... [id=sg-0ee0564992aca5f49,Owner]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.aws_ec2_tag.cluster_primary_security_group["Project"]: Refreshing state... [id=sg-0ee0564992aca5f49,Project]
module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0ee0564992aca5f49,Environment]
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Reading...
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 1s [id=vpc-cni]
module.eks.module.eks_managed_node_group["karpenter"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=2293781732865956663]
module.eks.module.eks_managed_node_group["karpenter"].aws_launch_template.this[0]: Refreshing state... [id=lt-0750e2da9a7d703ca]
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Read complete after 1s [id=eks-pod-identity-agent]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 1s [id=coredns]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 1s [id=kube-proxy]
module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=cluster-dev#arn:aws:iam::509399618437:role/aws-github-oidc#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.data.tls_certificate.this[0]: Read complete after 1s [id=8620fd676f1f5fb482fb77207743ac75042750fa]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::509399618437:oidc-provider/oidc.eks.ap-south-1.amazonaws.com/id/E0399DDF7AE7E493711C530C89E659E8]
module.eks.module.eks_managed_node_group["karpenter"].aws_eks_node_group.this[0]: Refreshing state... [id=cluster-dev:karpenter-20241130013046164100000024]
aws_eks_pod_identity_association.aws_lbc: Refreshing state... [id=a-bocwotwegcaxu3uq4]
aws_eks_access_entry.manager: Refreshing state... [id=cluster-dev:arn:aws:iam::509399618437:role/dev-eks-admin]
data.aws_eks_cluster_auth.default: Reading...
module.karpenter.aws_eks_pod_identity_association.karpenter[0]: Refreshing state... [id=a-xfzh0yozansbzqycs]
module.karpenter.aws_cloudwatch_event_rule.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20241130013010166700000018]
module.karpenter.aws_cloudwatch_event_rule.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-2024113001301017050000001b]
module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20241130013010166000000017]
module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20241130013010166800000019]
data.aws_eks_cluster_auth.default: Read complete after 0s [id=cluster-dev]
module.karpenter.aws_iam_role.node[0]: Refreshing state... [id=Karpenter-cluster-dev-20241130013010164700000016]
module.karpenter.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.ap-south-1.amazonaws.com/509399618437/Karpenter-cluster-dev]
helm_release.argocd: Refreshing state... [id=argocd]
helm_release.updater: Refreshing state... [id=updater]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=Karpenter-cluster-dev-20241130013010164700000016-2024113001301178440000001d]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKS_CNI_Policy"]: Refreshing state... [id=Karpenter-cluster-dev-20241130013010164700000016-2024113001301179260000001e]
module.karpenter.aws_iam_role_policy_attachment.node_additional["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=Karpenter-cluster-dev-20241130013010164700000016-2024113001301178270000001c]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=Karpenter-cluster-dev-20241130013010164700000016-2024113001301181380000001f]
module.eks.aws_eks_addon.this["eks-pod-identity-agent"]: Refreshing state... [id=cluster-dev:eks-pod-identity-agent]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=cluster-dev:kube-proxy]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=cluster-dev:vpc-cni]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=cluster-dev:coredns]
module.karpenter.data.aws_iam_policy_document.queue[0]: Reading...
helm_release.karpenter: Refreshing state... [id=karpenter]
module.karpenter.data.aws_iam_policy_document.queue[0]: Read complete after 0s [id=221800040]
module.karpenter.aws_sqs_queue_policy.this[0]: Refreshing state... [id=https://sqs.ap-south-1.amazonaws.com/509399618437/Karpenter-cluster-dev]
module.karpenter.data.aws_iam_policy_document.v033[0]: Reading...
module.karpenter.data.aws_iam_policy_document.v1[0]: Reading...
module.karpenter.aws_cloudwatch_event_target.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20241130013010166800000019-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20241130013010166700000018-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-2024113001301017050000001b-KarpenterInterruptionQueueTarget]
module.karpenter.data.aws_iam_policy_document.v033[0]: Read complete after 0s [id=2521767535]
module.karpenter.aws_cloudwatch_event_target.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20241130013010166000000017-KarpenterInterruptionQueueTarget]
module.karpenter.data.aws_iam_policy_document.v1[0]: Read complete after 0s [id=2762183751]
module.karpenter.data.aws_iam_policy_document.controller[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller[0]: Read complete after 0s [id=2762183751]
module.karpenter.aws_eks_access_entry.node[0]: Refreshing state... [id=cluster-dev:arn:aws:iam::509399618437:role/Karpenter-cluster-dev-20241130013010164700000016]
module.karpenter.aws_iam_policy.controller[0]: Refreshing state... [id=arn:aws:iam::509399618437:policy/KarpenterController-20241130013039428100000020]
module.karpenter.aws_iam_role_policy_attachment.controller[0]: Refreshing state... [id=KarpenterController-20241130012104460400000003-20241130013039711400000023]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.module.eks_managed_node_group["karpenter"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
        id                     = "cluster-dev:karpenter-20241130013046164100000024"
      + labels                 = {}
        tags                   = {
            "Environment" = "sandbox"
            "Name"        = "karpenter"
            "Owner"       = "Durgaprasad"
            "Project"     = "EKS-DNS-setup"
            "terraform"   = "true"
        }
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.argocd is tainted, so must be replaced
-/+ resource "helm_release" "argocd" {
      ~ id                         = "argocd" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "v2.2.5"
              - chart          = "argo-cd"
              - first_deployed = 1732930216
              - last_deployed  = 1732930216
              - name           = "argocd"
              - namespace      = "argocd"
              - notes          = <<-EOT
                    In order to access the server UI you have the following options:
                    
                    1. kubectl port-forward service/argocd-server -n argocd 8080:443
                    
                        and then open the browser on http://localhost:8080 and accept the certificate
                    
                    2. enable ingress in the values file `server.ingress.enabled` and either
                          - Add the annotation for ssl passthrough: https://github.com/argoproj/argo-cd/blob/master/docs/operator-manual/ingress.md#option-1-ssl-passthrough
                          - Add the `--insecure` flag to `server.extraArgs` in the values file and terminate SSL at your ingress: https://github.com/argoproj/argo-cd/blob/master/docs/operator-manual/ingress.md#option-2-multiple-ingress-objects-and-hosts
                    
                    
                    After reaching the UI the first time you can login with username: admin and the random password generated during the installation. You can find the password by running:
                    
                    kubectl -n argocd get secret argocd-initial-admin-secret -o jsonpath="{.data.password}" | base64 -d
                    
                    (You should delete the initial secret afterwards as suggested by the Getting Started Guide: https://github.com/argoproj/argo-cd/blob/master/docs/getting_started.md#4-login-using-the-cli)
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - global = {
                          - image = {
                              - tag = "v2.12.6"
                            }
                        }
                      - server = {
                          - extraArgs = [
                              - "--insecure",
                            ]
                        }
                    }
                )
              - version        = "3.35.4"
            },
        ] -> (known after apply)
        name                       = "argocd"
      ~ status                     = "failed" -> "deployed"
        # (26 unchanged attributes hidden)
    }

  # helm_release.aws_lbc will be created
  + resource "helm_release" "aws_lbc" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.9.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "cluster-dev"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "vpcId"
          + value = "vpc-0adadb769b1e56ccd"
            # (1 unchanged attribute hidden)
        }
    }

  # helm_release.metrics_server will be created
  + resource "helm_release" "metrics_server" {
      + atomic                     = false
      + chart                      = "metrics-server"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "metrics-server"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/metrics-server/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                ---
                defaultArgs:
                  - --cert-dir=/tmp
                  - --kubelet-preferred-address-types=InternalIP,ExternalIP,Hostname
                  - --kubelet-use-node-status-port
                  - --metric-resolution=15s
                  - --secure-port=10250
            EOT,
        ]
      + verify                     = false
      + version                    = "3.12.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.updater is tainted, so must be replaced
-/+ resource "helm_release" "updater" {
      ~ id                         = "updater" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "v0.12.2"
              - chart          = "argocd-image-updater"
              - first_deployed = 1732930213
              - last_deployed  = 1732930213
              - name           = "updater"
              - namespace      = "argocd"
              - revision       = 1
              - values         = jsonencode(
                    {
                      - image   = {
                          - tag = "v0.12.2"
                        }
                      - metrics = {
                          - enabled = true
                        }
                    }
                )
              - version        = "0.9.1"
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
        name                       = "updater"
      ~ status                     = "failed" -> "deployed"
        # (26 unchanged attributes hidden)
    }

  # kubectl_manifest.karpenter_node_class will be created
  + resource "kubectl_manifest" "karpenter_node_class" {
      + api_version             = "karpenter.k8s.aws/v1beta1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "EC2NodeClass"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "default"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.k8s.aws/v1beta1
            kind: EC2NodeClass
            metadata:
              name: default
            spec:
              amiFamily: AL2023
              role: Karpenter-cluster-dev-20241130013010164700000016
              securityGroupSelectorTerms:
              - tags:
                  karpenter.sh/discovery: cluster-dev
              subnetSelectorTerms:
              - tags:
                  karpenter.sh/discovery: cluster-dev
              tags:
                karpenter.sh/discovery: cluster-dev
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.karpenter_node_pool will be created
  + resource "kubectl_manifest" "karpenter_node_pool" {
      + api_version             = "karpenter.sh/v1beta1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "NodePool"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "default"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.sh/v1beta1
            kind: NodePool
            metadata:
              name: default
            spec:
              disruption:
                consolidateAfter: 30s
                consolidationPolicy: WhenEmpty
              limits:
                cpu: 1000
              template:
                spec:
                  nodeClassRef:
                    name: default
                  requirements:
                  - key: karpenter.k8s.aws/instance-category
                    operator: In
                    values:
                    - c
                    - m
                    - r
                  - key: karpenter.k8s.aws/instance-cpu
                    operator: In
                    values:
                    - "4"
                    - "8"
                    - "16"
                    - "32"
                  - key: karpenter.k8s.aws/instance-hypervisor
                    operator: In
                    values:
                    - nitro
                  - key: karpenter.k8s.aws/instance-generation
                    operator: Gt
                    values:
                    - "2"
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.eks.aws_eks_access_entry.this["example"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "cluster-dev"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::509399618437:root"
      + tags              = {
          + "Environment" = "sandbox"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + tags_all          = {
          + "Environment" = "sandbox"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.this["example_example"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = "cluster-dev"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::509399618437:root"

      + access_scope {
          + type = "cluster"
        }
    }

Plan: 8 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @durga61, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform AWS infra creation`*